source.org
*** couchdb-get actor
This actor is to be used by other actors wishing to interact with the couchdb database.
The message to be sent MUST be ~(cons sender data)~.
#+begin_src lisp :tangle ./source/actors.lisp :results none :comments link
(defparameter *couchdb-gets* nil "The Couchdb actor responsible for handling document gets.")

(defun start-couchdb-gets ()
  (setf *couchdb-gets* (ac:actor-of *sys* :name "*couchdb-gets*"
                                          :receive (lambda (msg)
                                                     (let ((pool *couchdb-pool*)
                                                           (db (uiop:getenv "COUCHDB_DATABASE")))
                                                       (with-context (*sys*)
                                                         (anypool:with-connection (client pool)
                                                           (task-async (lambda ()
                                                                         (handler-case
                                                                             (cl-couch:get-document client db (car msg))
                                                                           (dex:http-request-not-found (e) nil)
                                                                           (dex:http-request-unauthorized (e) nil)))
                                                                       :on-complete-fun (lambda (doc)
                                                                                          (reply doc (cdr msg)))))))))))

#+end_src

*** TODO finish bulk insert actor

#+begin_src lisp :tangle ./source/actors.lisp :results none :comments link
;; (defparameter *couchdb-bulk-insert* (ac:actor-of *sys*
;;                                                  :name "*couchdb-bulk-insert*"
;;                                                  :receive (lambda (msg)
;;                                                             (let ((destination-db (uiop:getenv "COUCHDB_DATABASE"))
;;                                                                   (pool *couchdb-pool*))
;;                                                               (anypool:with-connection (client pool)
;;                                                                 (cl-couch:bulk-create-documents client destination-db msg :batch "normal"))))))



#+end_src


#+end_src
** IDEA Document Handler
#+begin_src lisp
(defun start-document-handler-actor ()
  (defparameter *document-handler* (ac:actor-of *sys*)))


#+end_src
** TODO Create Target scheduling actor
It will be an actor that kicks off recurring jobs, will require spec change to include "recurring" field.
** actor entry point

#+begin_src lisp :tangle ./source/actors.lisp :results none :comments link
(defun start-actors ()
  (start-actor-system)
  (start-couchdb-inserts))
#+end_src

In order to compile the actor system must be stop

* RabbitMQ

** Macro Wrappers
The [[https://github.com/lokedhs/cl-rabbit][cl-rabbit]] lib is a bit lower level then I want to work with so I will create a basic macros to make the interface nicer

The newer sento benchmarks are showing its VERY performent now, so we will actually just create a agent, then use the sento actor system.

#+begin_src lisp :tangle ./source/rabbit.lisp :results none
(in-package :star.rabbit)

(defmacro with-rabbit-recv ((queue-name exchange-name exchange-type routing-key &key (port star:*rabbit-port*) (host star:*rabbit-address*) (username star:*rabbit-user*) (password star:*rabbit-password*) (vhost "/") (durable nil) (exclusive nil) (auto-delete nil)) &body body)
  `(cl-rabbit:with-connection (conn)
     (let ((socket (cl-rabbit:tcp-socket-new conn)))
       (cl-rabbit:socket-open socket ,host ,port)
       (when (and ,username ,password)
         (cl-rabbit:login-sasl-plain conn ,vhost ,username ,password))
       (cl-rabbit:with-channel (conn 1)
         (cl-rabbit:exchange-declare conn 1 ,exchange-name ,exchange-type)

         (cl-rabbit:queue-declare conn 1 :queue ,queue-name :durable ,durable :auto-delete ,auto-delete :exclusive ,exclusive)
         (cl-rabbit:queue-bind conn 1 :queue ,queue-name :exchange ,exchange-name :routing-key ,routing-key)

         (cl-rabbit:basic-consume conn 1 ,queue-name)
         (loop
           for msg = (cl-rabbit:envelope/message (cl-rabbit:consume-message conn))
           do ,@body)))))

(defmacro with-rabbit-send ((queue-name exchange-name exchange-type routing-key &key (port star:*rabbit-port*) (host star:*rabbit-address*) (username star:*rabbit-user*) (password star:*rabbit-password*) (vhost "/") (durable nil) (exclusive nil) (auto-delete nil)) &body body)
  `(cl-rabbit:with-connection (conn)
     (let ((socket (cl-rabbit:tcp-socket-new conn)))
       (cl-rabbit:socket-open socket ,host ,port)
       (when (and ,username ,password)
         (cl-rabbit:login-sasl-plain conn ,vhost ,username ,password))
       (cl-rabbit:with-channel (conn 1)

         ,@body))))

(defun emit-document (queue-name exchange routing-key body &key (properties nil)
                                                             (immediate nil)
                                                             (mandatory nil)
                                                             (port star:*rabbit-port*)
                                                             (host star:*rabbit-address*)
                                                             (username star:*rabbit-user*)
                                                             (password star:*rabbit-password*)
                                                             (vhost "/"))
  (cl-rabbit:with-connection (conn)
    (let ((socket (cl-rabbit:tcp-socket-new conn)))
      (cl-rabbit:socket-open socket host port)
      (when (and username password)
        (cl-rabbit:login-sasl-plain conn vhost username password))
      (cl-rabbit:with-channel (conn 1)

        (cl-rabbit:queue-bind conn 1 :queue queue-name :exchange exchange :routing-key routing-key)
        (cl-rabbit:basic-publish conn 1 :routing-key routing-key :exchange exchange :mandatory mandatory :immediate immediate :properties properties :body body)))))
#+end_src
** Handle New Document consumers

Take a rabbimq message and parse it.

#+begin_src lisp :tangle ./source/rabbit.lisp :results none
(defun message->string (msg &key (encoding :utf-8))
  "take a rabbitmq message and return the boddy as a string"
  (babel:octets-to-string (cl-rabbit:message/body msg) :encoding encoding))

                                        ;TODO
(defun message->object (msg)
  "Tale a rabbbitmq message and return a object. The object that will be returned depends on the message property 'dtype`.")

(defun handle-new-document (msg)
  "Handles any new incoming documents and sends it to the appropriate actors."
  (let* ((props (cl-rabbit:message/properties msg))
         (headers (assoc :HEADERS props :test #'equal))
         (dtype (when headers (cdr (assoc "dtype" (cdr headers) :test #'equal))))
         (body (message->string msg)))
    (cons dtype body)))
#+end_src

Start the rabbit new document monitoring thread.

#+begin_src lisp :tangle ./source/rabbit.lisp :results none
(defun start-rabbit-document-thread (&key (port star:*rabbit-port*) (host star:*rabbit-address*) (username star:*rabbit-user*) (password star:*rabbit-password*))
  (loop for i from 0 to 4
        do (bt:make-thread
            (lambda ()
              (with-rabbit-recv ("injest" "documents" "topic" "documents.new.*")
                (let (
                      (data (handle-new-document msg)))
                  (sento-user::ask sento-user::*couchdb-inserts* data))))
            ;; (sento-user::publish sento-user::*sys* (sento-user::new-event :topic (string-downcase (car data)) :data (cdr data)))


            :name "*new-documents*")))
#+end_src
** quick test functions

These functions are for quick debugging of the rabbitmq.

#+begin_src lisp :tangle ./source/rabbit.lisp :results none
(defun test-make-doc ()

  (with-output-to-string (str) (cl-json:encode-json (starintel:set-meta (make-instance  'starintel:person :id (uuid:make-v4-uuid) :lname "doe" :fname "john") "starintel") str)))

(defun test-send ()
  (cl-rabbit:with-connection (conn)
    (let ((socket (cl-rabbit:tcp-socket-new conn)))
      (cl-rabbit:socket-open socket "localhost" 5672)
      (cl-rabbit:login-sasl-plain conn "/" "guest" "guest")
      (cl-rabbit:with-channel (conn 1)
        (cl-rabbit:basic-publish conn 1
                                 :exchange "documents"
                                 :routing-key "documents.new.Person"
                                 :body (test-make-doc)
                                 :properties '((:headers . (("dtype"  . "Person")))))))))
#+end_src

* Databases
** Couchdb
#+begin_src lisp :tangle ./source/init.lisp :results none
(in-package :starintel-gserver)


(defun init-db ()
  "Create the database, and all map-reduce views with it."
  (let* ((client (cl-couch:new-couchdb (uiop:getenv "COUCHDB_HOST") (parse-integer (or (uiop:getenv "COUCHDB_PORT") 5984)) :scheme (string-downcase (uiop:getenv "COUCHDB_SCHEME"))))
         (database (or (uiop:getenv "COUCHDB_DATABASE") "starintel")))
    (cl-couch:password-auth client (uiop:getenv "COUCHDB_USER") (uiop:getenv "COUCHDB_PASSWORD"))
    (handler-case (cl-couch:get-database client database)
      (dexador:http-request-not-found () (cl-couch:create-database client database)))))

#+end_src
* Frontends
Frontends  are basicly APi services that allow external stuff to interact with this system.
** asdf

** http-api
*** Couchdb client pool
#+begin_src lisp :tangle ./source/frontends/http-api.lisp :results none :comments link
(defparameter *couchdb-pool*
  (anypool:make-pool :name "couchdb-connections"
                     :connector (lambda ()
                                  (let ((client (cl-couch:new-couchdb (uiop:getenv "COUCHDB_HOST") 5984 :scheme (string-downcase (uiop:getenv "COUCHDB_SCHEME")))))
                                    (cl-couch:password-auth client (uiop:getenv "COUCHDB_USER") (uiop:getenv "COUCHDB_PASSWORD"))
                                    client))

                     :disconnector (lambda (obj)
                                     (setf (cl-couch:couchdb-headers obj) nil))
                     :max-open-count 20))
#+end_src
*** STRT Authentication

*** TODO design map api
*** OKAY Submit documents
This route take input documents and inserts them into the rabbitmq =new-documents= queue.


#+begin_src lisp :tangle ./source/frontends/http-api.lisp :comments link
(setf (ningle:route *app* "/new/document/:dtype" :method :post)
      #'(lambda (params)

          (let ((dtype  (cdr (assoc :dtype params :test #'string=)))
                (doc (car (car (lack.request:request-body-parameters (ningle:context :request))))))

            (star.rabbit:emit-document  "new-documents" "documents"  (format nil "documents.new.~a" dtype) doc  :properties (list (list :headers `("dtype" . ,dtype))))
             (format nil "documents.new.~a" dtype))))




#+end_src

#+RESULTS:
: #<FUNCTION (LAMBDA (PARAMS)) {1001E4405B}>


#+begin_src http :comments none
POST http://0.0.0.0:5000/new/document/person

{"_id":"01HVPX96E8B1FWQCSRFE07Z07R","dataset":"","dtype":"","sources":null,"version":"0.7.1","dateUpdated":1713387117,"dateAdded":1713387117,"fname":"Klaus","mname":"","lname":"Shwabb","bio":"","dob":"","race":"","region":"","misc":null,"etype":"","eid":""}
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Thu, 18 Apr 2024 01:50:21 GMT
: Server: Hunchentoot 1.3.0
: Transfer-Encoding: chunked
: Content-Type: text/html; charset=utf-8
:
: documents.new.person
*** TODO Get Documents

#+begin_src lisp :tangle ./source/frontends/http-api.lisp :results none :comments link
(setf (ningle:route *app* "/document/:id" :method :get)
      #'(lambda (params)

          (let ((document-id  (cdr (assoc :id params :test #'string=))))

            (anypool:with-connection (client *couchdb-pool*)
              (cl-couch:get-document client "starintel" document-id)))))
#+end_src

**** example usage
#+begin_src http
GET 127.0.0.1:5000/document/01HVQ6STFR8TA2G6QC5M9EQJQ4
#+end_src

#+RESULTS:
: HTTP/1.1 200 OK
: Date: Fri, 19 Apr 2024 02:11:28 GMT
: Server: Hunchentoot 1.3.0
: Transfer-Encoding: chunked
: Content-Type: text/html; charset=utf-8
:
: {"_id":"01HVQ6STFR8TA2G6QC5M9EQJQ4","_rev":"1-f2c89cf0ec0edd4bce904a91e524da9e","dataset":"starintel","dtype":"person","sources":null,"version":"0.7.1","dateUpdated":1713397099,"dateAdded":1713397099,"fname":"john","mname":"","lname":"doe","bio":"","dob":"","race":"","region":"","misc":null,"etype":"","eid":""}

*** Start webapp
#+begin_src lisp :tangle ./source/frontends/http-api.lisp :comments link
                                        ;(couchdb-middleware *app*)
(defun start-http-api ()
  (clack:clackup *app* :address star:*http-api-address* :port star:*http-api-port*))
#+end_src

#+RESULTS:
: #S(CLACK.HANDLER::HANDLER
:    :SERVER :HUNCHENTOOT
:    :SWANK-PORT NIL
:    :ACCEPTOR #<BORDEAUX-THREADS-2:THREAD "clack-handler-hunchentoot" {10051142F3}>)


* Main Entry
