source.org
** Cli arg parsing
i opt to use clingon for cli arg parsing.[fn:2]
#+begin_src lisp :tangle ./source/main.lisp :results none :coments link
(in-package :starintel-gserver)
(defun server/options ()
  (list
   (clingon:make-option
    :string
    :description "Path to init file"
    :short-name #\i
    :long-name "init"
    :initial-value "./init.lisp"
    :env-vars '("STAR_SERVER_INIT_FILE")
    :key :init-value)
   (clingon:make-option
    :boolean
    :description "Enable Remote debugging"
    :short-name #\d
    :long-name "debugger"
    :key :debugger)))


#+end_src
** Server command handler
#+begin_src lisp :tangle ./source/main.lisp :results none :comments link

(defun server/handler (cmd)
  (let ((debugger (clingon:getopt cmd :debugger))
        (init-file (clingon:getopt cmd :init-value)))
    (when debugger
      (slynk:create-server :port 50006 :dont-close t))
    (load init-file :if-does-not-exist :create)
    (sento-user::start-actors)


    (sento-user::start-actors)
    (star.frontends.http-api::start-http-api)
    (star.rabbit:start-rabbit-document-thread :host *rabbit-address* :port *rabbit-port*)))

(defun server/command ()
  "A command to greet someone"
  (clingon:make-command
   :name "start"
   :description "start the server"
   :version "0.1.0"
   :authors '("nsaspy <nsaspy@airmail.cc>")
   :license "GPL v3"
   :options (server/options)
   :handler #'server/handler))


(defun main ()
  (clingon:run (server/command))
  (loop do (sleep 3)))
#+end_src

* Tasks
All tasks can have a very general headline, but the NAME must be topic.possibpe-sub-topic.thing scheme.
This section is for [[https://github.com/TxGVNN/project-tasks][project-tasks]].

#+Name:  open.rabbitmq
#+begin_src shell :async :results none
xdg-open http://127.0.0.1:15672/#/
#+end_src

#+Name: open couchdb
#+begin_src shell :async :results none
xdg-open http://127.0.0.1:5984/_utils
#+end_src



** Updates
#+Name: update.flake
#+begin_src shell :async :results output replace
nix flake update
direnv reload .
#+end_src

#+RESULTS: update.flake

#+RESULTS: Update flake
** Docker
*** Run a rabbitmq instance
#+Name: docker.run.rabbitmq
#+begin_src shell :async :results output replace :tangle start.sh
docker run -d -p 5672:5672 -p 15672:15672 -e RABBITMQ_USER=user -e RABBITMQ_PASS=password   rabbitmq:3.13.1-management
#+end_src

#+RESULTS: docker.run.rabbitmq
: 136e9a2898d2fd0d89d9d86ab88e67edeeb8167f2e979b154105256bd2a3726b

#+RESULTS: Start Rabbitmq

*** Kill Rabbitmq
#+Name: docker.kill.rabbitmq
#+begin_src shell :async :results output replace
docker kill rabbitmq_org_dev
#+end_src

#+RESULTS: docker.kill.rabbitmq
: rabbitmq_org_dev


*** List Docker PS
#+Name: docker.ps
#+begin_src shell :async :results output replace
docker ps
#+end_src
** Build
#+Name: build.server
#+begin_src sh :async :results output replace
make build
#+end_src

#+RESULTS: build.server
: b3bc5811a0bf8b118f78669449185d14

* Footnotes
[fn:2] https://github.com/dnaeon/clingon

[fn:1] https://gist.github.com/dnaeon/3a3f86dea1096db5a9231d1f56a565e2
